Waitr/app/controllers/parties_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @restaurant = Restaurant.find(params[:restaurant_id])

SELECT  "parties".* FROM "parties" WHERE "parties"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "parties" SET "in_queue" = $1, "updated_at" = $2 WHERE "parties"."id" = $3  [["in_queue", false], ["updated_at", 2016-07-25 13:41:40 UTC], ["id", 5]]
---
  def edit
    party = Party.find(params[:id])
    party.in_queue = false
    party.save

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "parties" ("restaurant_id", "name", "size", "cell", "created_at", "updated_at", "key") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["restaurant_id", 2], ["name", "Rewr"], ["size", 2], ["cell", "1234567890"], ["created_at", 2016-07-25 13:45:32 UTC], ["updated_at", 2016-07-25 13:45:32 UTC], ["key", "984306"]]
---
  def create

    @party = Party.new(party_params)
    p params[:restaurant_id]
    @restaurant = Restaurant.find(params[:restaurant_id])
    @party.restaurant_id = params[:restaurant_id]
    @party.in_queue = true
    if @party.save