Waitr/app/controllers/restaurants_controller.rb

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "parties".* FROM "parties" WHERE "parties"."restaurant_id" = $1 AND "parties"."in_queue" = $2 ORDER BY "parties"."created_at" ASC  [["restaurant_id", 2], ["in_queue", true]]
SELECT  "prizes".* FROM "prizes" WHERE "prizes"."restaurant_id" = $1 LIMIT $2  [["restaurant_id", 2], ["LIMIT", 1]]
---
  def show
  	if logged_in?
  		@restaurant = Restaurant.find(session[:restaurant_id])
  		params[:id] = session[:restaurant_id]
  	else
  		redirect_to login_path
  	end

    @parties = Party.where(restaurant_id: session[:restaurant_id], in_queue: true)
    @waiting_list = @parties.order(:created_at)
    @prize = @restaurant.prize
    @new = @waiting_list.map { |e| e.elapsed }